# -*- coding: utf-8 -*-
# Created by David on 2016/4/29.

import sys
import json
from ParserMapper import ParserMapper
reload(sys)
sys.setdefaultencoding('utf-8')


transform = {
    u"基本信息.*": ".*",
    u"股东信息.*": u"gdxx.*",
    u"股东及出资信息.*": u"gdxx.*",
    u"投资人信息.*": u"gdxx.*",
    u"主管部门（出资人）信息.*": u"gdxx.*",
    u"投资人及出资信息.*": u"gdxq.*",
    u"发起人.*": u"gdxx.*",
    u"合伙人.*": u"gdxx.*",
    u"变更信息.*": u"bgxx.*",
    u"主要人员信息.*": u"baxx.*",
    u"备案信息.*": u"baxx.*",
    u"成员名册.*": u"baxx.*",
    u"分支机构信息.*": u"fzjg.*",
    u"行政处罚信息.*": u"xzcf.*"
}

#region test

# json_result = [{"基本信息.营业期限自": "1997年05月23日", "基本信息.注册号": "110000005103737", "基本信息.营业期限至": "2047年05月22日", "基本信息.成立日期": "1997年05月23日", "基本信息.经营范围": "项目投资；投资管理；技术开发、技术转让、技术咨询、技术服务、网络技术培训；设备租赁；信息咨询（中介除外）；销售木材、建筑材料、机械设备、五金交电、化工产品（不含危险化学品及一类易制毒化学品）、电子计算机及外围设备、通讯器材、土产品。", "基本信息.注册资本": "5000 万元", "基本信息.名称": "北京中关村科技投资有限公司", "基本信息.登记机关": "顺义分局", "基本信息.法定代表人": "张澳", "基本信息.登记状态": "在营（开业）企业", "基本信息.住所": "北京市顺义区李遂镇佳佳路2号", "基本信息.核准日期": "2009年11月27日", "基本信息.类型": "其他有限责任公司"}, {"股东信息.详情": {"股东及出资信息.实缴明细.实缴出资日期": "", "股东及出资信息.实缴明细.实缴出资额（万元）": "50", "股东及出资信息.认缴明细.认缴出资方式": "", "股东及出资信息.认缴明细.认缴出资日期": "", "股东及出资信息.实缴额（万元）": "50", "股东及出资信息.实缴明细.实缴出资方式": "", "股东及出资信息.认缴额（万元）": "50", "股东及出资信息.股东": "北京民营科技实业家协会", "股东及出资信息.认缴明细.认缴出资额（万元）": "50"}, "股东信息.证照/证件号码": "ST000004", "股东信息.股东类型": "企业法人", "股东信息.证照/证件类型": "企业法人营业执照(非公司)", "股东信息.股东": "北京民营科技实业家协会"}, {"股东信息.详情": {"股东及出资信息.实缴明细.实缴出资日期": "", "股东及出资信息.实缴明细.实缴出资额（万元）": "2000", "股东及出资信息.认缴明细.认缴出资方式": "", "股东及出资信息.认缴明细.认缴出资日期": "", "股东及出资信息.实缴额（万元）": "2000", "股东及出资信息.实缴明细.实缴出资方式": "", "股东及出资信息.认缴额（万元）": "2000", "股东及出资信息.股东": "中融嘉尚（北京）投资管理有限公司", "股东及出资信息.认缴明细.认缴出资额（万元）": "2000"}, "股东信息.证照/证件号码": "110116006371806", "股东信息.股东类型": "企业法人", "股东信息.证照/证件类型": "企业法人营业执照(公司)", "股东信息.股东": "中融嘉尚（北京）投资管理有限公司"}, {"股东信息.详情": {"股东及出资信息.实缴明细.实缴出资日期": "", "股东及出资信息.实缴明细.实缴出资额（万元）": "2050", "股东及出资信息.认缴明细.认缴出资方式": "", "股东及出资信息.认缴明细.认缴出资日期": "", "股东及出资信息.实缴额（万元）": "2050", "股东及出资信息.实缴明细.实缴出资方式": "", "股东及出资信息.认缴额（万元）": "2050", "股东及出资信息.股东": "北京格林银通科技发展有限公司", "股东及出资信息.认缴明细.认缴出资额（万元）": "2050"}, "股东信息.证照/证件号码": "463121", "股东信息.股东类型": "企业法人", "股东信息.证照/证件类型": "企业法人营业执照(公司)", "股东信息.股东": "北京格林银通科技发展有限公司"}, {"股东信息.详情": {"股东及出资信息.实缴明细.实缴出资日期": "", "股东及出资信息.实缴明细.实缴出资额（万元）": "850", "股东及出资信息.认缴明细.认缴出资方式": "", "股东及出资信息.认缴明细.认缴出资日期": "", "股东及出资信息.实缴额（万元）": "850", "股东及出资信息.实缴明细.实缴出资方式": "", "股东及出资信息.认缴额（万元）": "850", "股东及出资信息.股东": "信远控股集团有限公司", "股东及出资信息.认缴明细.认缴出资额（万元）": "850"}, "股东信息.证照/证件号码": "1100001169786", "股东信息.股东类型": "企业法人", "股东信息.证照/证件类型": "企业法人营业执照(公司)", "股东信息.股东": "信远控股集团有限公司"}, {"股东信息.详情": {"股东及出资信息.实缴明细.实缴出资日期": "", "股东及出资信息.实缴明细.实缴出资额（万元）": "50", "股东及出资信息.认缴明细.认缴出资方式": "", "股东及出资信息.认缴明细.认缴出资日期": "", "股东及出资信息.实缴额（万元）": "50", "股东及出资信息.实缴明细.实缴出资方式": "", "股东及出资信息.认缴额（万元）": "50", "股东及出资信息.股东": "北京市理化应用技术研究所", "股东及出资信息.认缴明细.认缴出资额（万元）": "50"}, "股东信息.证照/证件号码": "264435", "股东信息.股东类型": "企业法人", "股东信息.证照/证件类型": "企业法人营业执照(非公司)", "股东信息.股东": "北京市理化应用技术研究所"}, {}, {"主要人员信息.职务": "董事长", "主要人员信息.姓名": "张澳", "主要人员信息.序号": "1"}, {"主要人员信息.职务": "董事", "主要人员信息.姓名": "宋斌", "主要人员信息.序号": "2"}, {"主要人员信息.职务": "董事", "主要人员信息.姓名": "周晓俊", "主要人员信息.序号": "3"}, {"主要人员信息.职务": "经理", "主要人员信息.姓名": "张澳", "主要人员信息.序号": "4"}, {"主要人员信息.职务": "监事", "主要人员信息.姓名": "芦素航", "主要人员信息.序号": "5"}, {}, {}]
json_result = [{"基本信息.营业期限自": "2009年06月25日", "基本信息.注册号": "441900000579286", "基本信息.营业期限至": "长期", "基本信息.成立日期": "2009年06月25日", "基本信息.登记状态": "存续", "基本信息.经营范围": "房地产开发。", "基本信息.注册资本": "1000万人民币元", "基本信息.经营场所": "东莞市东城区中信东泰花园富华苑A1座二楼", "基本信息.名称": "东莞市中信亿兆房地产开发有限公司", "基本信息.登记机关": "东莞市工商行政管理局", "基本信息.法定代表人": "李贤俊", "基本信息.统一社会信用代码": "91441900690498183H", "基本信息.核准日期": "2016年01月26日", "基本信息.类型": "其他有限责任公司"}, {"股东信息.详情": "{'href': '#', 'onclick': u\"return alert('\\u8be5\\u516c\\u53f8\\u7684\\u80a1\\u4e1c\\u53ca\\u51fa\\u8d44\\u4fe1\\u606f\\u57282014\\u5e743\\u67081\\u65e5\\u540e\\u53d1\\u751f\\u53d8\\u5316\\u7684,\\u80a1\\u4e1c\\u8be6\\u60c5\\u4f01\\u4e1a\\u81ea\\u4e3b\\u516c\\u793a');\"}", "股东信息.证照/证件号码": "4419002345781", "股东信息.股东类型": "企业法人", "股东信息.证照/证件类型": "营业执照", "股东信息.股东": "东莞市亿兆房地产开发有限公司"}, {}, {}, {}, {"股东信息.股东类型": "企业法人", "股东信息.股东": "中信地产东莞投资有限公司", "股东信息.证照/证件号码": "441900000416317", "invNo": "7b3eba91-0152-1000-e000-6e4c0a0c0115", "股东信息.详情": {"股东及出资信息.股东类型": "企业法人", "股东及出资信息.认缴出资日期": "", "股东及出资信息.出资方式": "货币出资", "股东及出资信息.认缴出资额": "400万人民币元", "股东及出资信息.实缴出资额": "400万人民币元", "股东及出资信息.股东": "中信地产东莞投资有限公司", "股东及出资信息.实缴出资时间": "2009年06月12日"}, "股东信息.证照/证件类型": "营业执照"}, {"股东信息.股东类型": "企业法人", "股东信息.股东": "东莞市龙泰房地产开发有限公司", "股东信息.证照/证件号码": "441900000100208", "invNo": "7b3eba91-0152-1000-e000-6e4e0a0c0115", "股东信息.详情": {"股东及出资信息.股东类型": "企业法人", "股东及出资信息.认缴出资日期": "", "股东及出资信息.出资方式": "货币出资", "股东及出资信息.认缴出资额": "210万人民币元", "股东及出资信息.实缴出资额": "210万人民币元", "股东及出资信息.股东": "东莞市龙泰房地产开发有限公司", "股东及出资信息.实缴出资时间": "2009年06月12日"}, "股东信息.证照/证件类型": "营业执照"}, {"股东信息.股东类型": "企业法人", "股东信息.股东": "东莞市亿兆房地产开发有限公司", "股东信息.证照/证件号码": "4419002345781", "invNo": "7b3eba91-0152-1000-e000-6e4d0a0c0115", "股东信息.详情": {"股东及出资信息.股东类型": "企业法人", "股东及出资信息.认缴出资日期": "", "股东及出资信息.出资方式": "货币出资", "股东及出资信息.认缴出资额": "390万人民币元", "股东及出资信息.实缴出资额": "390万人民币元", "股东及出资信息.股东": "东莞市亿兆房地产开发有限公司", "股东及出资信息.实缴出资时间": "2009年06月12日"}, "股东信息.证照/证件类型": "营业执照"}, {"变更信息.变更前内容": " ", "变更信息.变更事项": "法人股东", "变更信息.变更后内容": "股东发生变更", "变更信息.变更日期": "Apr 4, 2014 12:00:00 AM"}, {"变更信息.变更前内容": "林瑞明", "变更信息.变更事项": "法定代表人", "变更信息.变更后内容": "李贤俊", "变更信息.变更日期": "Apr 4, 2014 12:00:00 AM"}, {"主要人员信息.职务": "董事", "主要人员信息.姓名": "靳文龙"}, {"主要人员信息.职务": "董事", "主要人员信息.姓名": "喻红军"}, {"主要人员信息.职务": "董事长,总经理", "主要人员信息.姓名": "李贤俊"}, {"主要人员信息.职务": "监事", "主要人员信息.姓名": "李金仁"}, {"主要人员信息.职务": "监事", "主要人员信息.姓名": "刘小苑"}, {"主要人员信息.职务": "董事", "主要人员信息.姓名": "张惠"}, {"主要人员信息.职务": "董事", "主要人员信息.姓名": "刘祖兴"}]

if __name__ == "__main__":
    result_mapped_dict = ParserMapper.doMap(transform, json_result)
    print(json.dumps(result_mapped_dict))

#endregion


